data.df<-read.table("http://www.stats.uwo.ca/faculty/braun/data/rnf6080.dat")
names(data.df)
data.df$V7[5]
data.df[2,]
names(data.df) <- c("year", "month", "day", seq(0,23))
##Происходит переименование первых трех заголовков столбцов на 
##"year", "month", "day", а оставшиеся переименовываются перечисляемой 
##последовательностью от 0 до 23, т.е. количество часов в сутках
head(data.df)
##Первые 6 строчек
tail(data.df)
##Последние 6 строчек
head(data.df, 1)
##Первая строчка
tail(data.df, 1)
##Последняя строчка
data.df$daily<-0
data.df$daily<-rowSums(data.df[c(4:27)])
hist(data.df$daily, main = "Histogram", col = "lightgreen", xlab = "Daily")
##Из-за отрицательных данных строится неверная гистограмма, видимо ошибка наблюдений
fixed.df<-data.df
fixed.df$daily[fixed.df$daily<0]<-0
hist(fixed.df$daily, main = "Histogram", col = "lightgreen", xlab = "Daily")
##Данные отображаются без учета некорректных значений

v <- c("4", "8", "15", "16", "23", "42")
##Создается вектор с типома данных char, а не num
max(v)
##Максимальным числом признается 8, т.к. остальные числа разбиваются на цифры и оцениваются по раздельности
sort(v)
##То же самое с сортировкой, числа не оцениваются целиком, а лишь по составляющим цифрам
sum(v)
##Нет возможности суммировать разные типы данных.
##Для исправления ошибок, необходимо исправить значения вектора:
v<-as.numeric(v)
##или просто убрать скобки в исходном задании
v <- c(4, 8, 15, 16, 23, 42)

v2 <- c("5",7,12)
##В векторе не может быть данных различных типов, поэтому язык R приводит их к единому
v2[2] + 2[3]
##Опечатка
v2[2] + v2[3]
##Арифметический оператор к нечисловым значениям не работает
df3 <- data.frame(z1="5",z2=7,z3=12)
df3[1,2] + df3[1,3]
##data.frame позволяют использовать и сохранять разные типы данных, поэтому 2 и 3 значения сохраняются числовыми значениями

l4 <- list(z1="6", z2=42, z3="49", z4=126)
l4[[2]] + l4[[4]]
##Сложение данных типа numeric
l4[2] + l4[4]
##Неверный синтаксис
seq(1, 10000, by=372)
##Увеличение на 372 от предыдущего
seq(1, 10000, length.out = 50)
##Всего 50 значений
rep(1:5,times=3)
##Повторяет диапазон от 1 до 5 три раза
rep(1:5, each=3)
##Повторяет трижды каждое число и, после, переходит к следующему 
